compressible/resonators/rhoCentralFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 		0 		0)
    (1.7 	0 		0)
    (1.7 	0.05 	0)
    (0 		0.05 	0)
    (0 		0 		0.001)
    (1.7 	0 		0.001)
    (1.7 	0.05 	0.001)
    (0 		0.05 	0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type 		patch;
        faces		((0 4 7 3));
    }
    right
    {
        type 		wall;
        faces 		((2 6 5 1));
    }

    top
    {
        type        wall;
        faces 		((3 7 6 2));
    }

    bottom_axis
    {
        type        wall;
		faces		((1 5 4 0));
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
