compressible/resonators/rhoCentralFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            patch;
        nFaces          20;
        startFace       3880;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       3900;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       3920;
    }
    bottom_axis
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       4020;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       4120;
    }
)

// ************************************************************************* //
